ERP DEV.WMS/src/Catalogs/вмс_Звуки/вмс_Звуки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Звуки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Схема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_РаботаСоЗвукомСервер/Module.bsl
//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция НайтиЭлементыЗвуков(Звуки) Экспорт

	ОН = глОбщийМодуль("ОбщегоНазначенияСервер");
	
	ТаблицаЭлементовЗвуков = ОН.НайтиЭлементыИерархическогоСправочникаРасширенный("вмс_Звуки", Звуки, "Имя");
	ТаблицаЭлементовЗвуков = ТаблицаЭлементовЗвуков.Скопировать(Новый Структура("Найден", Истина));
	СсылкиЗвуков = Новый Массив;
	Для Каждого Звук Из ТаблицаЭлементовЗвуков Цикл
		СсылкиЗвуков.Добавить(Звук.Ссылка);
	КонецЦикла;
	
	ПоискПоСсылке = Новый Структура("Ссылка");

	ТаблицаГруппЗвуков = ТаблицаЭлементовЗвуков.Скопировать(Новый Структура("ЭтоГруппа, Дополнительный", Истина, Ложь));
	Если ТаблицаГруппЗвуков.Количество() > 0 Тогда
		ТаблицаЭлементовГруппЗвуков = ОН.НайтиЭлементыГруппСправочника("вмс_Звуки", ТаблицаГруппЗвуков, "Имя");
		Для Каждого ЗвукГруппы Из ТаблицаЭлементовГруппЗвуков Цикл
			ПоискПоСсылке.Ссылка = ЗвукГруппы.Ссылка;
			Если ТаблицаЭлементовЗвуков.НайтиСтроки(ПоискПоСсылке).Количество()=0 Тогда
				Звук = ТаблицаЭлементовЗвуков.Добавить();
				ЗаполнитьЗначенияСвойств(Звук, ЗвукГруппы);
				Звук.Дополнительный = Истина;
				СсылкиЗвуков.Добавить(ЗвукГруппы.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВерсииДанныхЗвуков = ПолучитьВерсииДанныхЗвуков(СсылкиЗвуков);
	
	ТаблицаЭлементовЗвуков.Колонки.Добавить("ВерсияДанных");
	
	Для Каждого Звук Из ТаблицаЭлементовЗвуков Цикл
		
		ПоискПоСсылке.Ссылка = Звук.Ссылка;
		ВерсияДанныхЗвука = ВерсииДанныхЗвуков.НайтиСтроки(ПоискПоСсылке)[0];
		Звук.ВерсияДанных = ВерсияДанныхЗвука.ВерсияДанных;
		
	КонецЦикла;
	
	ТаблицаЭлементовЗвуков.Колонки.Идентификатор.Имя = "ИмяЗвука";
	ТаблицаЭлементовЗвуков.Колонки.ИдентификаторРодителя.Имя = "ИмяРодителя";
	
	Возврат ТаблицаЭлементовЗвуков;
	
КонецФункции

Функция ПолучитьВерсииДанныхЗвуков(СсылкиЗвуков) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Звуки.Ссылка КАК Ссылка,
	|	вмс_Звуки.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	Справочник.вмс_Звуки КАК вмс_Звуки
	|ГДЕ
	|	вмс_Звуки.Ссылка В(&СсылкиЗвуков)";
	Запрос.УстановитьПараметр("СсылкиЗвуков", СсылкиЗвуков);
	
	ВерсииДанныхЗвуков = Новый ТаблицаЗначений;
	ВерсииДанныхЗвуков.Колонки.Добавить("Ссылка");
	ВерсииДанныхЗвуков.Колонки.Добавить("ВерсияДанных");
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		ВерсияДанныхЗвука = ВерсииДанныхЗвуков.Добавить();
		ВерсияДанныхЗвука.Ссылка = ВыборкаЗапроса.Ссылка;
		ВерсияДанныхЗвука.ВерсияДанных = ВыборкаЗапроса.ВерсияДанных;
	КонецЦикла;
	
	Возврат ВерсииДанныхЗвуков;
	
КонецФункции

Функция ПолучитьДанныеЗвуков(СсылкиЗвуков) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Звуки.Ссылка КАК Ссылка,
	|	вмс_Звуки.ЭтоГруппа КАК ЭтоГруппа,
	|	вмс_Звуки.Данные КАК Данные,
	|	вмс_Звуки.ЧастотаИспользования КАК ЧастотаИспользования
	|ИЗ
	|	Справочник.вмс_Звуки КАК вмс_Звуки
	|ГДЕ
	|	вмс_Звуки.Ссылка В(&СсылкиЗвуков)";
	Запрос.УстановитьПараметр("СсылкиЗвуков", СсылкиЗвуков);
	
	ДанныеЗвуков = Новый ТаблицаЗначений;
	ДанныеЗвуков.Колонки.Добавить("Ссылка");
	ДанныеЗвуков.Колонки.Добавить("Данные");
	ДанныеЗвуков.Колонки.Добавить("ЧастотаИспользования");
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		ДанныеЗвука = ДанныеЗвуков.Добавить();
		ДанныеЗвука.Ссылка = ВыборкаЗапроса.Ссылка;
		Если НЕ ВыборкаЗапроса.ЭтоГруппа Тогда
			ДанныеЗвука.Данные = ВыборкаЗапроса.Данные.Получить();
		КонецЕсли;
		ДанныеЗвука.ЧастотаИспользования = ВыборкаЗапроса.ЧастотаИспользования;
	КонецЦикла;
	
	Возврат ДанныеЗвуков;
	
КонецФункции
